recipes/vegetarian-chili.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegetarian Chili</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegetarian Chili</h1>
<p>
<a href="https://cookieandkate.com/vegetarian-chili-recipe/">Original link</a>
</p>

<div id="outline-container-org5073f37" class="outline-2">
<h2 id="org5073f37">Ingredients</h2>
<div class="outline-text-2" id="text-org5073f37">
<ul class="org-ul">
<li>2 tablespoons extra-virgin olive oil</li>
<li>1 medium red onion, chopped</li>
<li>1 large red bell pepper, chopped</li>
<li>2 medium carrots, chopped</li>
<li>2 ribs celery, chopped</li>
<li>1/2 teaspoon salt, divided</li>
<li>4 cloves garlic, pressed or minced</li>
<li>2 tablespoons chili powder*</li>
<li>2 teaspoons ground cumin</li>
<li>1 1/2 teaspoons smoked paprika*</li>
<li>1 teaspoon dried oregano</li>
<li>2 cans (800 g) diced tomatoes, with their juices</li>
<li>2 cans (800 g) black beans, rinsed and drained</li>
<li>1 can (400 g) pinto beans, rinsed and drained</li>
<li>2 cups vegetable broth or water</li>
<li>1 bay leaf</li>
<li>2 tablespoons chopped fresh cilantro, plus more for garnishing</li>
<li>1 to 2 teaspoons sherry vinegar or red wine vinegar or lime juice, to taste</li>
<li>Garnishes: chopped cilantro, sliced avocado, tortilla chips, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-org538e0ce" class="outline-2">
<h2 id="org538e0ce">Method</h2>
<div class="outline-text-2" id="text-org538e0ce">
<ol class="org-ol">
<li>In a large Dutch oven or heavy-bottomed pot over medium heat, warm the olive oil until shimmering. Add the chopped onion, bell pepper, carrot, celery and 1/4 teaspoon of the salt. Stir to combine and cook, stirring occasionally, until the vegetables are tender and the onion is translucent, about 7 to 10 minutes.</li>
<li>Add the garlic, chili powder, cumin, smoked paprika and oregano. Cook until fragrant while stirring constantly, about 1 minute.</li>
<li>Add the diced tomatoes and their juices, the drained black beans and pinto beans, vegetable broth and bay leaf. Stir to combine and let the mixture come to a simmer. Continue cooking, stirring occasionally and reducing heat as necessary to maintain a gentle simmer, for 30 minutes.</li>
<li>Remove the chili from the heat.</li>
<li>For the best texture and flavor, transfer 1 1/2 cups of the chili to a blender, making sure to get some of the liquid portion. Securely fasten the lid and blend until smooth (watch out for hot steam), then pour the blended mixture back into the pot. (Or, you can blend the chili briefly with an immersion blender, or mash the chili with a potato masher until it reaches a thicker, more chili-like consistency.)</li>
<li>Add the chopped cilantro, stir to blend, and then mix in the vinegar, to taste. Add salt to taste, too&#x2014;I added 1/4 teaspoon more at this point.</li>
<li>Divide the mixture into individual bowls and serve with garnishes of your choice. This chili will keep well in the refrigerator for about 4 days or you can freeze it for longer-term storage.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
